Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: Returns p's process ID.
ja: p のプロセス ID を返します。

source: Returns true if coroutine has not returned, false otherwise.
ja: コルーチンから復帰していなければ true を、それ以外は false を返します。

source: Returns true on success.
ja: 成功時は true を返します。

source: Returns v, with the bit at position bit flipped Source Edit
ja: Returns v, with the bit at position bit flipped ソース 編集

source: Returns v, with the bit at position bit set to 0 Source Edit
ja: Returns v, with the bit at position bit set to 0 ソース 編集

source: Returns v, with the bit at position bit set to 1 Source Edit
ja: Returns v, with the bit at position bit set to 1 ソース 編集

source: Returns v, with the bits at positions bits set to 0 Source Edit
ja: Returns v, with the bits at positions bits set to 0 ソース 編集

source: Returns v, with the bits at positions bits set to 1 Source Edit
ja: Returns v, with the bits at positions bits set to 1 ソース 編集

source: Returns x as it is.
ja: そのまま x を返します。

source: Returns x converted to a decimal string.
ja: x を十進数文字列へ変換して返します。

source: Returns x converted to a string.
ja: x を文字列へ変換して返します。

source: Returns x converted to the string "false" or "true".
ja: x を文字列 "false" または "true" へ変換して返します。

source: Returns z in polar coordinates.
ja: z の極座標を返します。

source: Returns z's string representation as "(re, im)".
ja: z の文字列表記として "(re, im)" を返します。

source: Returns false if the end of the file has been reached, true otherwise.
ja: ファイル終端へ到達したならば false を、そうでなければ true を返します。

source: Returns default if ext could not be found.
ja: ext が見つからないときは default を返します。

source: Returns default if mimetype could not be found.
ja: mimetype が見つからないときは default を返します。

source: Returns nil on failure.
ja: 失敗時は nil を返します。

source: Returns a future that will complete when the FutureStream has data placed into it.
ja: FutureStream にデータが置かれたときに完了する Future を返します。

source: Returns a list of filenames in the given directory.
ja: 指定されたディレクトリにあるファイル名のリストを返します。

source: Returns a range with all bit positions for type T Source Edit
ja: Returns a range with all bit positions for type T ソース 編集

source: Returns a seq of Items that describe the differences.
ja: 差異を記述したシーケンス Items を返します。

source: Returns a sequence of Items that describe the differences.
ja: 差異を記述したシーケンス Items を返します。

source: Returns a string representation of x (serialization, marshalling).
ja: x の文字列表記を返します (シリアライゼーション、マーシャリング)。

source: Returns base type for distinct types, works only for distinct types.
ja: distinct 型における基底型であり、 distinct 型に限り動作します。

source: Returns cstring for given column of the row.
ja: 指定された行にある列の cstring を返します。

source: Returns file status in a Stat structure Source Edit
ja: ファイルの状態をStat 構造体で返します ソース 編集

source: Returns immediately.
ja: 即座に返値が返されます。

source: Returns nil if the library could not be loaded.
ja: ライブラリがロードできないときは nil を返します。

source: Returns nil if the symbol could not be found.
ja: シンボルが見つからないときは nil を返します。

source: Returns number of columns in a row.
ja: 指定された行にある列の数値を返します。

source: Returns number of columns in the row Source Edit
ja: 指定された行にある列の数値を返します ソース 編集

source: Returns number of columns in the row.
ja: 指定された行にある列の数値を返します。

source: Returns only after coroutine c has returned.
ja: コルーチン c から復帰したときに限り返します。

source: Returns text for given column of the row Source Edit
ja: 指定された行にある列のテキストを返します ソース 編集

source: Returns text for given column of the row.
ja: 指定された行にある列のテキストを返します。

source: Returns the unicode-rune edit distance between a and b.
ja: Unicode ルーン文字における a から b までの編集距離を返します。

source: Returns the i'th child of n so that it can be modified.
ja: n にある i 番目の子を変更可能にして返します。

source: Returns the i'th child of n.
ja: n にある i 番目の子を返します。

source: Returns the IPv4 any address, which can be used to listen on all available network adapters Source Edit
ja: Returns the IPv4 any address, which can be used to listen on all available network adapters ソース 編集

source: Returns the IPv4 broadcast address (255.255.255.255) Source Edit
ja: IPv4 のブロードキャストアドレスを返します (255.255.255.255) ソース 編集

source: Returns the IPv4 loopback address (127.0.0.1) Source Edit
ja: IPv4 のループバックアドレスを返します (127.0.0.1) ソース 編集

source: Returns the IPv6 any address (::0), which can be used to listen on all available network adapters Source Edit
ja: Returns the IPv6 any address (::0), which can be used to listen on all available network adapters ソース 編集

source: Returns the IPv6 loopback address (::1) Source Edit
ja: Returns the IPv6 loopback address (::1) ソース 編集

source: Returns the actual number of bytes that have been read which may be less than len (if not as many bytes are remaining), but not greater.
ja: 読み取られた実バイト数は len 以上ではなく、それ以下 (残りバイト数と同数ではない) で返します。

source: Returns the amount of data pieces inside the stream.
ja: ストリームにあるデータ断片量を返します。

source: Returns the arity of the given type.
ja: 指定された型のアリティを返します。

source: Returns the complex number with polar coordinates r and phi.
ja: 極座標 r と phi により複素数を返します。

source: Returns the cosecant of z.
ja: z の余割を返します。

source: Returns the cosine of z.
ja: z の余弦を返します。

source: Returns the cotangent of z.
ja: z の余接を返します。

source: Returns the current number of messages in the channel c.
ja: チャンネル c における現在のメッセージ件数を返します。

source: Returns the current working directory.
ja: 現在の作業ディレクトリを返します。

source: Returns the currently running nim or nimble executable.
ja: 現在実行中の nim または nimble 実行可能ファイルを返します。

source: Returns the directory name.
ja: ディレクトリ名を返します。

source: Returns the directory of the application's executable.
ja: アプリケーションの実行可能ファイルがあるディレクトリを返します。

source: Returns the distro's native command line to install 'foreignPackageName' and whether it requires root/admin rights.
ja: 'foreignPackageName' のインストールで使うディストリビューションのネイティブコマンドライン、および root/admin 権限が必要であるかの有無を返します。

source: Returns the edit distance between a and b.
ja: a から b までの編集距離を返します。

source: Returns the filename and a file opened in r/w mode.
ja: ファイルを読み書き可能モードで開いてファイル名を返します。

source: Returns the filename of the application's executable.
ja: アプリケーションの実行可能ファイル名を返します。

source: Returns the hyperbolic cosecant of z.
ja: z の双曲線余割を返します。

source: Returns the hyperbolic cosine of z.
ja: z の双曲線余弦を返します。

source: Returns the hyperbolic cotangent of z.
ja: z の双曲線余接を返します。

source: Returns the hyperbolic secant of z.
ja: z の双曲線正割を返します。

source: Returns the hyperbolic sine of z.
ja: z の双曲線正弦を返します。

source: Returns the hyperbolic tangent of z.
ja: z の双曲線正接を返します。

source: Returns the inverse cosecant of z.
ja: z の逆余割を返します。

source: Returns the inverse cosine of z.
ja: z の逆余弦を返します。

source: Returns the inverse cotangent of z.
ja: z の逆余接を返します。

source: Returns the inverse hyperbolic cosecant of z.
ja: z の逆双曲線余割を返します。

source: Returns the inverse hyperbolic cosine of z.
ja: z の逆双曲線余弦を返します。

source: Returns the inverse hyperbolic cotangent of z.
ja: z の逆双曲線余接を返します。

source: Returns the inverse hyperbolic secant of z.
ja: z の逆双曲線正割を返します。

source: Returns the inverse hyperbolic sine of z.
ja: z の逆双曲線正弦を返します。

source: Returns the inverse hyperbolic tangent of z.
ja: z の逆双曲線正接を返します。

source: Returns the inverse secant of z.
ja: z の逆正割を返します。

source: Returns the inverse sine of z.
ja: z の逆正弦を返します。

source: Returns the inverse tangent of z.
ja: z の逆正接を返します。

source: Returns the local hostname (not the FQDN) Source Edit
ja: Returns the local hostname (not the FQDN) ソース 編集

source: Returns the log base 10 of z.
ja: 10 を底とする常用対数 z を返します。

source: Returns the log base 2 of z.
ja: 2 を底とする対数 z を返します。

source: Returns the name of the given type.
ja: 指定された型の名前を返します。

source: Returns the natural log of z.
ja: 自然対数 z を返します。

source: Returns the next pseudo random number ranging from 0 to high(uint32) Source Edit
ja: 0 ～ 最大値 (uint32) までの擬似乱数を返します。 ソース 編集

source: Returns the number of n's attributes.
ja: n の属性数を返します。

source: Returns the number of n's children.
ja: n にある子の個数を返します。

source: Returns the number of actual written bytes, which may be less than len in case of an error.
ja: 書き込まれた実バイト数を返しますが、 len 以下ならばエラーになります。

source: Returns the number of bytes used.
ja: 使用したバイト数を返します。

source: Returns the number of the processors/cores the machine has.
ja: マシンに搭載されているプロセッサ / コア数を返します。

source: Returns the phase of z.
ja: z の位相を返します。

source: Returns the secant of z.
ja: z の正割を返します。

source: Returns the sine of z.
ja: z の正弦を返します。

source: Returns the socket's file descriptor Source Edit
ja: Returns the socket's file descriptor ソース 編集

source: Returns the string representation of a SecureHash.
ja: SecureHash 形式の文字列を返します。

source: Returns the string.
ja: 文字列を返します。

source: Returns the tangent of z.
ja: z の正接を返します。

source: Returns the terminal width and height as a tuple.
ja: ターミナルの幅と高さをタプルで返します。

source: Returns the thread handle of t.
ja: t のスレッドハンドルを返します。

source: Returns the underlying 'tag' string by reference.
ja: 参照により隠されている 'tag' 文字列を返します。

source: Returns the underlying 'text' string by reference.
ja: 参照により隠されている 'text' 文字列を返します。

source: Returns the value of a specific rnField node.
ja: 指定された rnField ノードの値を返します。

source: Returns true if f is associated with a terminal device.
ja: f がターミナルと関連付けられているならば true を返します。

source: Returns true if name is a known color name or a hexadecimal color prefixed with #.
ja: name が認識可能なカラー名、または接頭辞が # から成る１６進数値ならば true を返します。

source: Returns true if t is running.
ja: t が実行中であれば true を返します。

source: Returns true if a terminal supports true color.
ja: ターミナルがトゥルーカラーをサポートしていれば true を返します。

source: Returns true if the addresses are equal Source Edit
ja: Returns true if the addresses are equal ソース 編集

source: Returns true if the bit in v at positions bit is set to 1 Source Edit
ja: Returns true if the bit in v at positions bit is set to 1 ソース 編集

source: Returns true iff c does not contain the given key.
ja: c に指定された key がない場合に限り true を返します。

source: Returns true iff f is at the end.
ja: f が終端に到達した場合に限り true を返します。

source: Returns true iff s ends with suffix.
ja: s の先頭が suffix ならば true を返します。

source: Returns true iff s starts with prefix.
ja: s の先頭が prefix ならば true を返します。

source: Returns true iff some thread is waiting on the channel c for new messages.
ja: スレッドにおいてチャンネル c で新着メッセージを待機している場合に限り trueを返します。

source: Returns true iff the file could be opened.
ja: ファイルを開けたときに限り true を返します。

source: Returns true iff the file could be reopened.
ja: ファイルを開き直せたときに限り true を返します。

source: Returns true iff the process p is still running.
ja: プロセス p が未だ実行中である場合に限り、 true を返します。

source: Returns zero on success.
ja: 成功時は 0 を返します。

source: Returns:
ja: 返値:

source: Rings
ja: リング

source: Rokas Kupstys
ja: Rokas Kupstys (ロカス・クプスタイス)

source: Root type of the JavaScript object hierarchy Source Edit
ja: Root type of the JavaScript object hierarchy ソース 編集

source: Rows are retrieved from the server at each iteration.
ja: イテレートごとにサーバーから行を取得します。

source: Rune(0) is returned if the entity name is unknown.
ja: 未知のエンティティ名ならば Rune(0) が返されます。

source: Runs beforeRunEvent before running each command.
ja: 各コマンドの実行前に beforeRunEvent を実行します。

source: Runs the query (typically "UPDATE") and returns the number of affected rows Source Edit
ja: クエリを実行後 (通常は "UPDATE") に処理対象となった行数を返します ソース 編集

source: Runtime checks (see -x):
ja: ランタイム検査 (-x を参照):

source: Runtime type information
ja: 実行時型情報

source: SEXP node Source Edit
ja: SEXP ノード ソース 編集

source: SHA-1 (Secure Hash Algorithm 1) is a cryptographic hash function which takes an input and produces a 160-bit (20-byte) hash value known as a message digest.
ja: SHA-1 (Secure Hash Algorithm 1) はメッセージダイジェストとして知られている 160-bit (20-byte) によるハッシュ値の入力と生成を処理する暗号化ハッシュ関数です。

source: SQL parser object Source Edit
ja: SQL パーサーのオブジェクト ソース 編集

source: Same as fastRows, but slower and safe.
ja: fastRows と似ていますが、安全性を優先しているため処理速度は遅いです。

source: Same as fastRows but returns a handle that can be used to get column text on demand using [].
ja: fastRows と似ていますが、 [] で要求されたテキスト列の取得に使えるハンドルを返します。

source: Same for 8/16 Source Edit
ja: Same for 8/16 ソース 編集

source: Same for 8/16/32 Source Edit
ja: Same for 8/16/32 ソース 編集

source: Sample output
ja: 出力例

source: Scan for SSL/TLS CA certificates on disk The default locations can be overridden using the SSL_CERT_FILE and SSL_CERT_DIR environment variables.
ja: ディスクから SSL/TLS CA 証明書をスキャンします。デフォルトの格納先は環境変数 SSL_CERT_FILE と SSL_CERT_DIR でオーバーライドできます。

source: Scan for SSL/TLS CA certificates on disk.
ja: ディスクから SSL/TLS CA 証明書をスキャンします。

source: Schedule coroutine for execution.
ja: コルーチンの実行スケジュールです。

source: Scope rules
ja: スコープルール

source: Scopes and the block statement
ja: スコープと block ステートメント

source: Search path handling
ja: 検索パスの処理

source: Search paths modifications.
ja: 検索パスの変更。

source: Search:
ja: 検索

source: Searches for bin in the current working directory and then in directories listed in the PATH environment variable.
ja: 現在の作業ディレクトリと環境変数 PATH に記述されているディレクトのリストからバイナリを検索します。

source: Section
ja: 区分

source: See distros for tools to detect Linux distribution at runtime.
ja: Linux ディストリビューションをツールで検出するには distros を参照してください。

source: See http://www.postgresql.org/docs/current/static/libpq-connect.html#LIBPQ-CONNSTRING for more information.
ja: 詳細情報は http://www.postgresql.org/docs/current/static/libpq-connect.html#LIBPQ-CONNSTRING を参照してください。

source: See https://github.com/nim-lang/Nim/labels/Installation for installation-related bugs.
ja: インストール関連のバグは https://github.com/nim-lang/Nim/labels/Installation を参照してください。

source: See packaging for hints on distributing Nim using OS packages.
ja: OS パッケージを用いて Nim を配布するヒントについては packaging を参照してください。

source: See the manual for details of this memory model.
ja: このメモリモデルに関する詳細情報はマニュアルを参照してください。

source: See https://github.com/nim-lang/RFCs/issues/193 and https://github.com/nim-lang/RFCs/issues/192 for details leading to this particular design.
ja: この注目すべき設計が生み出された背景については https://github.com/nim-lang/RFCs/issues/193 ならびに https://github.com/nim-lang/RFCs/issues/192 を参照してください。

source: See also
ja: 関連

source: See also Ordinal Source Edit
ja: See also Ordinal ソース 編集

source: See also the API naming design document.
ja: 詳しくは API 命名仕様書のドキュメンテーションを参照してください。

source: See also:
ja: 関連:

source: See also: Limitations of the method call syntax.
ja: 関連: Limitations of the method call syntax.

source: See also: allocShared0.
ja: 関連: allocShared0.

source: See also: db_odbc, db_sqlite, db_mysql.
ja: 関連: db_odbc, db_sqlite, db_mysql.

source: See also: db_odbc, db_sqlite, db_postgres.
ja: 関連: db_odbc, db_sqlite, db_postgres.

source: See also: db_postgres, db_sqlite, db_mysql.
ja: 関連: db_postgres, db_sqlite, db_mysql.

source: See also: https://en.wikipedia.org/wiki/Tz_database
ja: 関連: https://en.wikipedia.org/wiki/Tz_database

source: See also:ven
ja: 関連:

source: See its source code for available options.
ja: 利用できるオプションについてはソースコードを参照してください。

source: See source switch
ja: ソース参照用スイッチ

source: See the documentation of ProcessOption for the meaning of these flags.
ja: フラグの意味については ProcessOption のドキュメンテーションを参照してください。

source: See top-level example.
ja: 文頭の用例を参照してください。

source: See, e.g.:
ja: 参考文献:

source: See:
ja: 参考文献:

source: Self was deleted.
ja: Self が削除された。

source: Self was moved.
ja: Self が移動された。

source: Semantic Checking
ja: セマンティクス検査

source: Semantically the same as cmp(normalize($a), normalize($b)).
ja: cmp(normalize($a), normalize($b)) と同じ意味です。

source: Sempass2: effects
ja: Sempass2: エフェクト

source: Send a message to the server, and wait for a primary reply.
ja: サーバーへメッセージを送信して、最初の応答を待機します。

source: Sends msg from fromAddr to the addresses specified in toAddrs.
ja: fromAddr からの msg を toAddrs で指定されたアドレスへ送信します。

source: Sends a message to a thread.
ja: スレッドへメッセージを送信します。

source: Sends a signal to a running process by calling kill.
ja: kill を呼び出すことで実行中のプロセスにシグナルを送信します。

source: Sends an AUTH command to the server to login as the username using password.
ja: username を用いて password としてログインするためにサーバーへ AUTH コマンドを送信します。

source: Sends the specified headers to the requesting client.
ja: リクエスト側のクライアントへ指定されたヘッダを送信します。

source: Sequences
ja: シーケンス

source: Set PSK identity hint to use.
ja: ヒントとして使う PSK 認証情報を設定します。

source: Set a file length.
ja: ファイルの長さを設定します。

source: Set callback called when OpenSSL needs PSK (for client).
ja: OpenSSL で PSK が要求されるときに呼び出されるコールバックを設定します (クライアント側)。

source: Set callback called when OpenSSL needs PSK (for server).
ja: OpenSSL で PSK が要求されるときに呼び出されるコールバックを設定します (サーバー側)。

source: Set it to 0 to disable time based profiling; it uses an imprecise instruction count measure instead then.
ja: タイムベース・プロファイリングを無効化するには 0 を設定してください。無効時はインストラクションカウントの計測が不正確になります。

source: Set the SNI server name extension to be used in a client hello.
ja: Client Hello で使われる SNI サーバ名拡張機能を設定します。

source: Set the callback to be used on listening SSL connections when the client hello is received.
ja: Client Hello を受信したときに SSL 接続のリスニングで使われるコールバックを設定します。

source: Set the pointer to be used in the callback registered to SSL_CTX_set_tlsext_servername_callback.
ja: SSL_CTX_set_tlsext_servername_callback に登録されたコールバックで使われるポインタを設定します。

source: Set this to influence how mkDir, rmDir, rmFile etc. behave Source Edit
ja: この設定は how mkDir, rmDir, rmFile などの動作に影響します ソース 編集

source: Sets
ja: 集合

source: Sets a Nim compiler command line switch, for example switch("checks", "on").
ja: switch("checks", "on") などの Nim コンパイラのコマンドスイッチを設定します。

source: Sets a configuration 'key' like 'gcc.options.always' to its value.
ja: 'gcc.options.always' などの構成 'key' に値を設定します。

source: Sets a cookie.
ja: クッキーを設定します。

source: Sets an assertion failure handler that will intercept any assert statements following onFailedAssert in the current module scope.
ja: 現在のモジュールスコープにある onFailedAssert に従い assert ステートメントを妨害するアサーション失敗ハンドラを設定します。

source: Sets file access and modification times.
ja: ファイルのアクセス時刻と変更時刻を設定します。

source: Sets the Nim command that should be continued with after this Nimscript has finished.
ja: この Nimscript の終了後に続行する Nim コマンドを設定します。

source: Sets the associated text with the node n.
ja: ノード n へ関連するテキストを設定します。

source: Sets the attributes belonging to n.
ja: n の所属先となる属性を設定します。

source: Sets the callback proc to be called when data was placed inside the future stream.
ja: Future ストリームにデータが置かれたときコールバックのプロシージャが呼び出されるようにするための設定をします。

source: Sets the client data of n.
ja: n のクライアントデータを設定します。

source: Sets the encoding of a database connection, returns true for success, false for failure.
ja: データベース接続のエンコーディングを設定します。成功時は true を、失敗時は false を返します。

source: Sets the position of the file pointer that is used for read/write operations.
ja: 読み書き処理で使われるファイルポインタの位置を設定します。

source: Sets the tag name of n.
ja: n のタグ名を設定します。

source: Sets the terminal style.
ja: ターミナルのスタイルを設定します。

source: Sets the terminal's background color.
ja: ターミナルの背景表示色を設定します。

source: Sets the terminal's background true color.
ja: トゥルーカラーによるターミナルの背景表示色を設定します。

source: Sets the terminal's cursor to the (x,y) position.
ja: ターミナルのカーソルの (x,y) 座標を設定します。

source: Sets the terminal's cursor to the x position.
ja: ターミナルのカーソルの x 座標を設定します。

source: Sets the terminal's cursor to the y position.
ja: ターミナルのカーソルの y 座標を設定します。

source: Sets the terminal's foreground color.
ja: ターミナルの文字表示色を設定します。

source: Sets the terminal's foreground true color.
ja: トゥルーカラーによるターミナルの文字表示色を設定します。

source: Sets the value of the environment variable named key to val.
ja: key で指名された環境変数に値 val を設定します。

source: Setup code to be executed when Unix signals are received.
ja: Unix シグナル受信時に実行されるコードを設定します。

source: Shared list support.
ja: 共有リストのサポート。

source: Short description of Nim's modules
ja: Nim のモジュールの手短な概要

source: Should not be used in performance sensitive code.
ja: 動作速度に敏感なコードでは使用しないでください。

source: Shows global variables declarations.
ja: グローバル変数の宣言を表示。

source: Shows the cursor.
ja: カーソルを表示状態にします。

source: Shows when the C compiler is called.
ja: C コンパイラが呼び出されたときに表示。

source: Similar to fastRows iterator but returns a handle that can be used to get column text on demand using [].
ja: fastRows イテレータと似ていますが、 [] で要求されたテキスト列の取得に使えるハンドルを返します。

source: Similar to fastRows iterator, but slower and safe.
ja: fastRows イテレータ と似ていますが、安全性を優先しているため処理速度は遅いです。

source: Similar to instantRows iterator, but sets information about columns to columns.
ja: instantRows イテレータと似ていますが、列の情報を columns へ設定します。

source: Similar to assert but is always turned on regardless of --assertions.
ja: assert と似ていますが、 --assertions オプションの指定にかかわらずアサーションは有効になります。

source: Similar to write, but treating terminal style arguments specially.
ja: write と似ていますが、ターミナルの style 引数を処理することに特化しています。

source: Similarly, if you hide the cursor, make sure to unhide it with showCursor before quitting.
ja: また、カーソルを非表示状態にしているときは、必ず終了前に showCursor でカーソルを表示状態にしてください。

source: Since the profiler works by examining stack traces, it's essential that the option --stackTrace:on is active!
ja: プロファイラはスタックトレースの検査処理をするため、 --stackTrace:on オプションを有効にすることは必須です。

source: Since version 0.8.2 many symbols have been renamed to fit this scheme.
ja: この体系に準拠させるためにバージョン 0.8.2 よりシンボルを多数改名しました。

source: Slices
ja: スライス

source: So this is a strictly one-way transformation.
ja: 厳密に言えば不可逆変換です。

source: So you should use finished to check whether data is available.
ja: よって、完了後にデータが利用可能であるか確認するときにお使い下さい。

source: Some features of the markdown wiki syntax are also supported.
ja: markdown Wiki シンタックスの一部機能もサポートしています。

source: Some file not essential for the compiler's working could not be opened.
ja: コンパイラの動作に必須ではないファイルを開けない。

source: Some information is lost in this transformation, of course, since several Unicode strings can be transformed in the same ASCII representation.
ja: 無論、この変換処理では何種類かの Unicode 文字列は類似の ASCII 表記へ変換されてしまうため一部情報が欠落します。

source: Some user defined warning.
ja: ユーザ定義による警告。

source: Source Code Filters
ja: ソースコードフィルタ

source: Source highlighter for programming or markup languages.
ja: プログラミング言語、またはマークアップ言語用のソースハイライターです。

source: Special future that acts as a queue.
ja: キュー機能に特化した Future です。

source: Specifies an OS Error Code.
ja: オペレーティング・システムのエラーコード指定。

source: Specifying fromProc, which is a string specifying the name of the proc that this future belongs to, is a good habit as it helps with debugging.
ja: fromProc への引数として、 future が所属するプロシージャ名を文字列で指定することは、デバッグ時に役に立つため良い慣習であります。

source: Square root for a complex number z.
ja: 複素数 z の平方根です。

source: StackTrace option
ja: StackTrace オプション

source: Standard input, output, error streams are inherited from the calling process.
ja: 呼び出し元プロセスから標準入力、標準出力、標準エラーのストリームを継承します。

source: Standard library
ja: 標準ライブラリ

source: Starting with version 0.19 of Nim this is not directly supported anymore as it breaks incremental compilations.
ja: インクリメンタル・コンパイルを壊してしまうため Nim version 0.19 以降ではサポートされていません。

source: Starts a process.
ja: プロセスを開始します。

source: Starts main coroutine scheduler loop which exits when all coroutines exit.
ja: コルーチンがすべて終了したときにメイン・コルーチンに関するスケジューラのループを開始します。

source: Starts the process of listening for incoming HTTP connections on the specified address and port.
ja: HTTP 接続で指定されたアドレスとポートの着信待ち受け処理を開始します。

source: Statements
ja: ステートメント

source: Statements and expressions
ja: ステートメントと式

source: Statements and indentation
ja: ステートメントとインデント

source: Static statement/expression
ja: Static ステートメント/式

source: Stop signal, iff WIFSTOPPED(s) Source Edit
ja: WIFSIGNALED の場合に限り、停止シグナルとなります ソース 編集

source: Stop the process p.
ja: プロセス p を停止します。

source: Stops coroutine execution and resumes no sooner than after sleeptime seconds.
ja: コルーチンの実行を停止しますが sleeptime 秒後に再開します。

source: Stores data into the stream s.
ja: s をストリーム data へ格納します。

source: Stream interface that supports writing or reading.
ja: 読み書きをサポートしたストリームインタフェースです。

source: String and character literals
ja: 文字列と文字リテラル

source: String handling
ja: 文字列処理

source: String literals
ja: 文字列リテラル

source: StringStream example
ja: StringStream の用例

source: Strings
ja: 文字列

source: Subfile was created.
ja: サブファイルが作られた。

source: Subfile was deleted.
ja: サブファイルが削除された。

source: Subranges
ja: 部分範囲型

source: Subsystems and code owners
ja: サブシステムとコードの権利所有者
